Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_rights/unfair_terms.html.txt.tmx
Source language: en
Languages: ga

source: Unfair terms in consumer contracts
ga: Téarmaí éagóracha i gconarthaí tomhaltóirí

source: Consumers have legislative protection from unfair terms in consumer contracts
ga: Tá cosaint dhlíthiúil ag tomhaltóirí in aghaidh téarmaí éagóracha sna conarthaí a dhéantar leo

source: An unfair term in a standard consumer contract is a term that is significantly weighted against the consumer
ga: Is éard is téarma éagórach ann i gconradh caighdeánta tomhaltóra ná téarma a thugann buntáiste suntasach don pháirtí eile

source: In other words, the contract contains a statement that puts the consumer at a disadvantage
ga: Is é sin le rá, go bhfuil ráiteas sa chonradh atá ina mhíbhuntáiste don tomhaltóir

source: A supplier of goods or services can have an advantage over the consumer by including such an unfair term in a contract
ga: D’fhéadfadh sé go mbeidh buntáiste ag an té a bheadh ag soláthar earraí nó seirbhísí ar an tomhaltóir trína leithéid de théarma éagórach a chur isteach i gconradh

source: Under The European Communities (Unfair Terms in Consumer Contracts) Regulations, (SI 27/1995) however, consumer contracts are open to a test of fairness
ga: Faoi Rialacháin na gComhphobal Eorpach (Téarmaí Éagóracha i gConarthaí Tomhaltóirí), (I.R. 27/1995), áfach, is féidir tástáil chothroime a dhéanamh ar chonarthaí tomhaltóirí

source: Any term found by a Court to be unfair, is ineffective
ga: Ní bhíonn éifeacht ag aon téarma a mheasann Cúirt a bheith éagórach

source: SI 27/1995 was amended by SI 307/2000 and SI 160/2013
ga: Leasaigh I.R. 307/2000 agus I.R. 160/2013 I.R. 27/1995

source: The Competition and Consumer Protection Commission has supervisory powers to ensure compliance with the legislation
ga: Tá cumhachtaí maoirsithe ag an gCoimisiún um Iomaíocht agus Cosaint Tomhaltóirí le comhlíonadh na reachtaíochta a chinntiú

source: In certain circumstances, the CCPC may seek a court order preventing the use of contract terms that are considered to be unfair
ga: Faoi roinnt cúinsí, féadfaidh an CICT ordú cúirte a lorg a leagann cosc ar théarmaí conartha a úsáid a mheastar atá éagórach

source: The CCPC publishes a detailed guide to unfair terms and conditions in consumer contracts
ga: Foilsíonn an CICT treoir mhionsonraithe maidir le téarmaí agus coinníollacha éagóracha i gconarthaí tomhaltóirí

source: What are terms in a consumer contract?
ga: Céard is téarmaí ann i gconradh tomhaltóra?

source: A contract is an agreement between 2 or more people that is enforceable by law
ga: Is éard atá i gconradh ná comhaontú idir bheirt, nó níos mó ná sin, a bhfuil éifeacht dhlíthiúil aige

source: When you buy goods or services you enter into a contract with the supplier of goods and services
ga: Nuair a cheannaíonn tú earraí nó seirbhís déanann tú conradh le soláthraí na n-earraí nó na seirbhísí sin

source: This is called a consumer contract
ga: Conradh tomhaltóra a thugtar air seo

source: Specifically a consumer is a person who is buying a service or a product from someone whose normal business it is to sell that product or service
ga: Is éard is tomhaltóir ann ná duine atá ag ceannach seirbhíse nó earra ó dhuine arb é a g(h)náthghnó é an tseirbhís nó an earra sin a dhíol

source: Contracts may be written or oral
ga: Is féidir le conradh a bheith i scríbhinn nó ó bhéal

source: It is easier to know precisely what the terms are in a written contract but an oral contract is also enforceable in law
ga: Is fusa a rá go cruinn céard iad na téarmaí atá i gceist i gconradh i scríbhinn ach is féidir conradh ó bhéal a chur i bhfeidhm de réir an dlí freisin

source: Consumer contracts may differ and there are no hard and fast rules governing what terms should be in a consumer contract
ga: Is iomaí leagan amach ar féidir a bheith ar conarthaí tomhaltóirí agus níl aon riail daingean ann faoi na téarmaí ar chóir a bheith iontu

source: Contracts are made up of terms and there are different types of terms in consumer contracts
ga: Bíonn téarmaí i ngach conradh agus is iomaí cineál téarma a bhíonn i gconarthaí tomhaltóirí

source: Implied terms are not mentioned in a written or oral consumer contract but exist all the same
ga: Ní dhéantar tagairt do théarmaí atá intuigthe i gconradh tomhaltóra, bíodh sé i scríbhinn nó ó bhéal, ach tá siad ann mar sin féin

source: An example of an implied term might be that the product or service will last for a reasonable length of time taking the cost of the item or service into account
ga: Sampla de théarma intuigthe is ea go mairfeadh an earra nó an tseirbhís ar feadh achar réasúnta ama nuair a chuirtear costas an earra nó na seirbhíse san áireamh

source: Mandatory terms are terms that by law have to be included in contracts – these are not common in consumer contracts
ga: Is éard atá i téarmaí sainordaitheacha ná téarmaí a chaithfear a chur i gconarthaí de réir an dlí

source: Core terms are terms that set out the main conditions of a contract
ga: Ní minic a fhaightear iad seo i gconarthaí tomhaltóirí

source: In a consumer contract, these core terms might include the price of the product or service
ga: Is éard atá i gcroí-théarmaí ná na téarmaí sin a shocraíonn príomhchoinníollacha an chonartha

source: Neither core terms nor mandatory terms are covered by the EU Unfair Terms in Consumer Contracts Regulation 1995
ga: I gcás conradh le tomhaltóir, d’fhéadfadh na croí-théarmaí seo a rá céard é praghas an earra nó na seirbhíse

source: These regulations take into account the circumstances surrounding the conclusion of the contract: for example, whether the product or service was sold to the consumer in a fair and equitable manner
ga: Cuireann na rialúcháin seo na cúinsí san áireamh a bhí ann ag conclúidiú an chonartha. Mar shampla, ar díoladh an t-earra nó an tseirbhís don tomhaltóir ar bhealach cóir cothrom

source: The regulations do not however, apply to any term that has been individually negotiated in a contract between a consumer and a supplier of goods and services
ga: Ní bhaineann na rialúcháin seo le haon téarma a ndearna an tomhaltóir agus táirgí an earra nó na seirbhíse socrú eatarthu féin mar gheall air

source: They also do not cover contracts between individuals selling products or services outside the course of their normal business or between one trader and another
ga: Ní bhaineann siad ach oireadh le conarthaí idir daoine aonair atá ag díol earraí nó seirbhísí nach mbaineann lena ngnáthchúrsaí gnó, nó le conarthaí idir ceannaí amháin agus ceannaí eile

source: Other contracts relating to employment, succession rights, family law or the formation of companies or partnerships are not covered by the regulations
ga: Ní bhaineann na rialúcháin ach oireadh le conarthaí eile a bhfuil baint acu le fostaíocht, cearta comharbais, bunú comhlachtaí nó comhpháirtíochtaí

source: What is meant by an unfair term?
ga: Céard a chiallaíonn “téarma éagórach”?

source: As explained above, an unfair term in a consumer contract is a term that can cause a significant imbalance in the parties’ rights and obligations to the detriment of the consumer
ga: Faoi mar a míníodh thuas, is ionann téarma éagórach i gconradh le tomhaltóir agus téarma a dhéanann difríocht shuntasach do chearta agus oibleagáidí na bpáirtithe agus gurb é an tomhaltóir atá thíos leis

source: There are 3 main categories that unfair terms may fall into:
ga: Tá 3 phríomhrannóg a bhaineann le téarmaí éagóracha

source: • Terms that give the supplier of goods or services the right to change the terms of the contract
ga: • Téarmaí a thugann an ceart do soláthraí na n-earraí nó na seirbhísí athrú a dhéanamh ar théarmaí an chonartha

source: • Terms that limit the liability of the supplier of goods and services: for example no liability for death or personal injury arising out of an act or an omission by the supplier of goods or services
ga: Mar shampla, téarmaí a déarfadh nach raibh soláthraí na n-earraí nó na seirbhísí freagrach as bás nó dochar pearsanta a thiocfadh de bharr gníomh nó faillí a dhéanfadh sé nó sí

source: • Terms that put an unfair burden on the consumer: for example a contract with a term stating that a deposit will be kept by the supplier of goods or services if the consumer cancels the contract but does not include a term saying that the supplier of goods or services will pay compensation if it does not fulfil its commitments
ga: • Téarmaí a leagann ualach éagórach ar an tomhaltóir. Mar shampla, téarma a déarfadh go bhféadfadh soláthraí na n-earraí nó na seirbhísí éarlais a choinneáil dá gcuirfeadh an tomhaltóir an conradh ar ceal ach gan aon téarma a bheith ann a déarfadh go n-íocfadh an soláthraí cúiteamh mura gcomhlíonfaí na gealltanais

source: This list is not exhaustive
ga: Níl an liosta seo iomlán

source: Terms that fit into one of the above categories may be fair, and equally, a term may be deemed to be unfair which does not fit into one of the above categories
ga: D’fhéadfadh téarmaí a bheith cóir fiú dá mbainfeadh siad le ceann de na rannóga thuas, agus fós b’fhéidir go ndéarfadh cúirt go raibh téarma éagórach is nach mbeadh baint dá laghad aige le rannóg ar bith acu

source: Unfair terms violate the principle of good faith
ga: Sáraíonn téarmaí éagóracha prionsabal na hintinne maithe

source: If you enter a contract in good faith it means that your intentions are honest
ga: Má dhéanann tú conradh agus intinn mhaith agat ciallaíonn sé go bhfuil cuspóirí macánta agat

source: The principle of good faith could be violated by, for example, inserting a term in the small print of the contract agreement where the consumer cannot see it easily
ga: D’fhéadfaí sárú a dhéanamh ar phrionsabal seo na hintinne maithe, mar shampla, dá gcuirfí téarma isteach is mionchló an chonartha áit nach bhfeicfeadh an tomhaltóir é go réidh

source: In the case of written contracts, all terms must be written in plain, understandable language
ga: I gcás gach conradh scríofa, ní mór gach téarma a scríobh go soiléir simplí sothuigthe

source: If there is a doubt about the meaning of a term, the meaning that is most favourable to the consumer will prevail
ga: Má tá amhras ann faoi théarma ar bith, glacfar leis an míniú is fabhraí don tomhaltóir

source: If a term in the contract is found to be unfair, the remainder of the contract may still be legally binding on the consumer and the supplier of goods or services
ga: Má fhaightear go bhfuil téarma éagórach i gconradh, d’fhéadfadh ceangal dlíthiúil a bheith fós ar an tomhaltóir agus ar sholáthraí na n-earraí nó na seirbhísí an chuid eile den chonradh a chomhlíonadh

source: This means that while one term or condition of the contract may be illegal, the remainder of the contract remains in force
ga: Ciallaíonn sé seo go bhféadfadh téarma nó coinníoll amháin i gconradh a bheith in aghaidh an dlí ach go mbeadh an chuid eile den chonradh fós i bhfeidhm

source: Complaints about unfair terms in consumer contracts should be made to the Competition and Consumer Protection Commission (CCPC)
ga: Ba chóir do dhaoine a bhfuil ábhar gearáin acu maidir le téarmaí éagóracha i conarthaí tomhaltóirí dul i dteagmháil leis an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC)

source: Normally an unfair term in a consumer contract will only come to light if a problem arises between a consumer and a supplier of goods and services
ga: De ghnáth ní thagann téarma éagórach i gconradh le tomhaltóir chun solais mura mbíonn fadhb éigin ann idir an té sin agus soláthraí na n-earraí nó na seirbhísí

source: If you feel that a term in a contract is unfair you should bring it to the attention of the Competition and Consumer Protection Commission (CCPC)
ga: Más dóigh leat go bhfuil téarma éagórach i gconradh a rinne tú ba chóir duit CCPC a chur ar an eolas faoi
